"""В текстовом файле с именем filename дано арифметическое выражение в
префиксной форме. Операндами в выражении являются целые числа из промежутка от 0 до 9.
Используемые операции: сложение (+), вычитание (-), умножение (*), деление нацело (/),
целочисленный остаток от деления (%) и возведение в степень (^). Постройте дерево,
соответствующее данному выражению. Знаки операций кодируйте числами: сложение(-1),
вычитание(-2), умножение(-3), деление(-4), остаток от деления(-5), возведение в степень (-6).
Преобразуйте дерево так, чтобы в нем не было операций возведения в степень (замените
поддеревья, в которых есть возведение в степень, значением данного поддерева). Выведите
указатель на корень полученного дерева."""