"""Юный путешественник решил изучить схему авиационного сообщения Схема
авиационного сообщения задана в текстовом файле с именем FileName1. в виде матрицы
смежности. Первая строка файла содержит количество городов (n) n<=15, связанных
авиационным сообщением, а следующие n строк хранят матрицу (m), m[i][j]=0, если не
имеется возможности перелета из города i в город j, иначе m[i][j]=1. Определить сколько
есть маршрутов из города К1 в город К2 с L пересадками. В файл с именем FileName2 в
первой строке выведите число таких маршрутов, а в следующих строках перечислите все
такие маршруты в лексикографическом порядке. Маршрут задается перечислением
номеров городов, нумерация городов идет с 1. Если таких маршрутов нет, выведите число
(-1)."""