"""
Даны ссылки A1 и A2 на начало и конец очереди, содержащей не менее пяти
элементов. Включить в класс IntQueue (см. задание Dynamic26) функцию Dequeue целого типа
(без параметров), которая извлекает из очереди первый (начальный) элемент, возвращает его
значение и вызывает для него метод Dispose. С помощью функции Dequeue извлечь из
исходной очереди пять начальных элементов и вывести их значения. Вывести также ссылки на
начало и конец результирующей очереди (если очередь окажется пустой, то эти ссылки
должны быть равны null).
"""