"""
Требуется создать игру для некоторого количества игроков (правила игры описаны в задаче).
Обязательно наличие: пользовательского интерфейса, классов, компьютерного противника.
Графический интерфейс не обязателен, можно заменить текстовым.
Изначально на столе лежат три кучки из 10, 11 и 12 камней соответственно. Илья и
Костя играют в следующую игру. За один ход каждый из них может взять себе один камень из
любой кучи, кроме той, из которой он брал камень на своем предыдущем ходе (на своём
первом ходе каждый игрок может брать камень из любой кучки). Ходы игроки делают по
очереди. Проигрывает тот, кто не может сделать ход.
"""