"""
Петя и Вася играют в следующую игру. У них есть клетчатый прямоугольник 50 × 101,
первым ходит Петя. Своим ходом первый игрок делит прямоугольник на два меньших одним
разрезом вдоль линии сетки. Затем второй игрок выбирает один из двух получившихся
прямоугольников, на котором будет продолжаться игра (второй прямоугольник
отбрасывается), и делит его на два меньших. Потом опять первый выбирает прямоугольник, на
котором будет продолжаться игра, и т. д. Проигрывает тот, кто не может в свой ход разрезать
прямоугольник.
"""